#pragma once
#include "EditorDefine.h"

namespace Editor
{
    // ********************************************************************************
    /// <summary>
    /// 出力クラス
    /// </summary>
    // ********************************************************************************
    class IExporter
    {
    public:
        // ********************************************************************************
        /// <summary>
        /// デストラクタ
        /// </summary>
        // ********************************************************************************
        virtual ~IExporter() = default;

        // ********************************************************************************
        /// <summary>
        /// 書き出し
        /// </summary>
        /// <param name="file">ファイルパス</param>
        /// <returns>TRUE 成功, それ以外 失敗</returns>
        // ********************************************************************************
        virtual MofBool Export(LPCMofChar file) = 0;
    };

    using ExporterPtr = std::shared_ptr<IExporter>;
}