#pragma once
#include "EditorDefine.h"

namespace Editor
{
    // ********************************************************************************
    /// <summary>
    /// ファイル読み込みクラス
    /// </summary>
    // ********************************************************************************
    class IFileLoader
    {
    public:
        // ********************************************************************************
        /// <summary>
        /// デストラクタ
        /// </summary>
        // ********************************************************************************
        virtual ~IFileLoader() = default;

        // ********************************************************************************
        /// <summary>
        /// 読み込み
        /// </summary>
        /// <param name="file">ファイルパス</param>
        /// <returns>TRUE 成功, それ以外 失敗</returns>
        // ********************************************************************************
        virtual MofBool Load(LPCMofChar filePath) = 0;

        // ********************************************************************************
        /// <summary>
        /// データの取得
        /// </summary>
        /// <returns>データ</returns>
        // ********************************************************************************
        virtual const void* GetData() const noexcept = 0;

        // ********************************************************************************
        /// <summary>
        /// データサイズの取得
        /// </summary>
        /// <returns>データサイズ</returns>
        // ********************************************************************************
        virtual const MofS32 GetDataSize() const noexcept = 0;
    };
    // ポインタ置き換え
    using FileLoaderPtr = std::shared_ptr<IFileLoader>;
}