#pragma once
#include "EditorDefine.h"
#include "FileBinaryLoader.h"

namespace Editor
{
    // ********************************************************************************
    /// <summary>
    /// パーサークラス
    /// </summary>
    // ********************************************************************************
    class IParser
    {
    public:
        // ********************************************************************************
        /// <summary>
        /// デストラクタ
        /// </summary>
        // ********************************************************************************
        virtual ~IParser() = default;

        // ********************************************************************************
        /// <summary>
        /// パーサー
        /// </summary>
        /// <param name="data">データ</param>
        /// <returns>TRUE 成功, それ以外 失敗</returns>
        // ********************************************************************************
        virtual MofBool Parse(FileLoaderPtr data) = 0;
    };

    // ポインタ置き換え
    using ParserPtr = std::shared_ptr<IParser>;
}